Tekla Open API Reference for Tekla Structures 2025
GridAttributes Constructor
Overload List
Name | Description
Grid.GridAttributes()
 Creates a new default grid attributes instance that loads standard attributes.
Grid.GridAttributes(String)
 Creates a new grid attributes instance that loads the specified attributes.
Top
See Also
Reference
Grid.GridAttributes Class
Tekla.Structures.Drawing Namespace